duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_VER_CHECK].para&SCREEN_EVENT_UPDATE_FOTA)
		{
			scr_msg[SCREEN_ID_VER_CHECK].para &= (~SCREEN_EVENT_UPDATE_FOTA);
			VerCheckUpdateStatus();
		}

		if(scr_msg[SCREEN_ID_VER_CHECK].para == SCREEN_EVENT_UPDATE_NO)
			scr_msg[SCREEN_ID_VER_CHECK].act = SCREEN_ACTION_NO;
		break;
	}
}

void EnterVerCheckScreen(void)
{
	if(screen_id == SCREEN_ID_VER_CHECK)
		return;
	
	k_timer_stop(&mainmenu_timer);

#ifdef CONFIG_ANIMATION_SUPPORT	
	AnimaStop();
#endif
#ifdef CONFIG_TEMP_SUPPORT
	if(TempIsWorking())
		MenuStopTemp();
#endif

	LCD_Set_BL_Mode(LCD_BL_ALWAYS_ON);

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_VER_CHECK;	
	scr_msg[SCREEN_ID_VER_CHECK].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_VER_CHECK].status = SCREEN_STATUS_CREATING;

	VerCheckStart();
}

void FOTAShowStatus(void)
{
	LCD_Clear(BLACK);
#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else	
	LCD_SetFontSize(FONT_SIZE_16);
#endif
	
	LCD_ShowImg_From_Flash(FOTA_LOGO_X, FOTA_LOGO_Y, IMG_OTA_LOGO_ADDR);
	LCD_ShowImg_From_Flash(FOTA_YES_X, FOTA_YES_Y, IMG_OTA_YES_ADDR);
	LCD_ShowImg_From_Flash(FOTA_NO_X, FOTA_NO_Y, IMG_OTA_NO_ADDR);

#ifdef FONTMAKER_UNICODE_FONT
  #ifdef LANGUAGE_AR_ENABLE
	if(g_language_r2l)
		LCD_AdaptShowUniStrRtoLInRect(FOTA_START_STR_X+FOTA_START_STR_W, FOTA_START_STR_Y, FOTA_START_STR_W, FOTA_START_STR_H, STR_ID_FW_UPGRADE_REQUEST, SHOW_ALIGN_CENTER, SHOW_ALIGN_CENTER);
	else
  #endif		
		LCD_AdaptShowUniStrInRect(FOTA_START_STR_X, FOTA_START_STR_Y, FOTA_START_STR_W, FOTA_START_STR_H, STR_ID_FW_UPGRADE_REQUEST, SHOW_ALIGN_CENTER, SHOW_ALIGN_CENTER);
#endif

	SetRightKeyUpHandler(fota_excu);
	SetLeftKeyUpHandler(fota_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_YES_X-30, FOTA_YES_X+FOTA_YES_W+30, FOTA_YES_Y-30, FOTA_YES_Y+FOTA_YES_H+30, fota_excu);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NO_X-30, FOTA_NO_X+FOTA_NO_W+30, FOTA_NO_Y-30, FOTA_NO_Y+FOTA_NO_H+30, fota_exit);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_exit);	
#endif
}

void FOTAUpdateStatus(void)
{
	uint16_t pro_len;
	uint16_t x,y,w,h;
	uint8_t pro_buf[16] = {0};
	uint16_t tmpbuf[128] = {0};
	static bool flag = false;
	static uint16_t pro_str_x,pro_str_y;

#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif	
	switch(get_fota_status())
	{
	case FOTA_STATUS_PREPARE:
		flag = false;
		break;
		
	case FOTA_STATUS_LINKING:
		{
			LCD_Fill(0, FOTA_YES_Y, LCD_WIDTH, FOTA_YES_H, BLACK);
			LCD_Fill(0, FOTA_START_STR_Y, LCD_WIDTH, FOTA_START_STR_H, BLACK);

		#ifdef FONTMAKER_UNICODE_FONT
			LCD_MeasureUniStr(STR_ID_FW_LINKING_TO_SERVER, &w, &h);
		  #ifdef LANGUAGE_AR_ENABLE	
			if(g_language_r2l)
			{
				x = w > FOTA_START_STR_W ? (FOTA_START_STR_X+FOTA_START_STR_W) : (LCD_WIDTH+w)/2;
				LCD_ShowUniStrRtoL(x, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, STR_ID_FW_LINKING_TO_SERVER);
			}
			else
		  #endif
			{
				x = w > FOTA_START_STR_W ? FOTA_START_STR_X : (LCD_WIDTH-w)/2;
				LCD_ShowUniStr(x, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, STR_ID_FW_LINKING_TO_SERVER);
		  	}
		#endif

			ClearAllKeyHandler();
		}
		break;
		
	case FOTA_STATUS_DOWNLOADING:
		if(!flag)
		{
			flag = true;
			
			LCD_Fill(0, FOTA_START_STR_Y, LCD_WIDTH, FOTA_START_STR_H, BLACK);

			LCD_MeasureUniStr(STR_ID_FW_DOWNLOADING_DATA, &w, &h);
		#ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
			{
				x = w > FOTA_START_STR_W ? (FOTA_START_STR_X+FOTA_START_STR_W) : (LCD_WIDTH+w)/2;
				LCD_ShowUniStrRtoL(x, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, STR_ID_FW_DOWNLOADING_DATA);
			}
			else
		#endif
			{
				x = w > FOTA_START_STR_W ? FOTA_START_STR_X : (LCD_WIDTH-w)/2;
				LCD_ShowUniStr(x, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, STR_ID_FW_DOWNLOADING_DATA);
			}
					
			LCD_DrawRectangle(FOTA_PROGRESS_X, FOTA_PROGRESS_Y, FOTA_PROGRESS_W, FOTA_PROGRESS_H);
			LCD_Fill(FOTA_PROGRESS_X+1, FOTA_PROGRESS_Y+1, FOTA_PROGRESS_W-1, FOTA_PROGRESS_H-1, BLACK);
			
			sprintf(pro_buf, "%d%%", g_fota_progress);
		#ifdef FONTMAKER_UNICODE_FONT
			LCD_SetFontSize(FONT_SIZE_20);
		#else	
			LCD_SetFontSize(FONT_SIZE_16);
		#endif
			memset(tmpbuf, 0x0000, sizeof(tmpbuf));
			mmi_asc_to_ucs2(tmpbuf, pro_buf);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			pro_str_x = FOTA_PRO_NUM_X+(FOTA_PRO_NUM_W-w)/2;
			pro_str_y = FOTA_PRO_NUM_Y+(FOTA_PRO_NUM_H-h)/2;
			LCD_ShowUniString(pro_str_x,pro_str_y, tmpbuf);
		}
		else
		{
			pro_len = (g_fota_progress*FOTA_PROGRESS_W)/100;
			LCD_Fill(FOTA_PROGRESS_X+1, FOTA_PROGRESS_Y+1, pro_len, FOTA_PROGRESS_H-1, WHITE);
			
			sprintf(pro_buf, "%d%%", g_fota_progress);
			memset(tmpbuf, 0x0000, sizeof(tmpbuf));
			mmi_asc_to_ucs2(tmpbuf, pro_buf);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			LCD_ShowUniString(pro_str_x, pro_str_y, tmpbuf);
		}		

		ClearAllKeyHandler();
		break;
		
	case FOTA_STATUS_FINISHED:
		{
			static bool is_finished = false;
			
			flag = false;

			if(!is_finished)
			{
				is_finished = true;
				
				LCD_Clear(BLACK);
				LCD_ShowImg_From_Flash(FOTA_FINISH_ICON_X, FOTA_FINISH_ICON_Y, IMG_OTA_FINISH_ICON_ADDR);
				
			#ifdef FONTMAKER_UNICODE_FONT
				LCD_MeasureUniStr(STR_ID_FW_UPGRADE_SUCCESSFUL, &w, &h);
			  #ifdef LANGUAGE_AR_ENABLE	
				if(g_language_r2l)
				{
					x = w > FOTA_START_STR_W ? (FOTA_START_STR_X+FOTA_START_STR_W) : (LCD_WIDTH+w)/2;
					LCD_ShowUniStrRtoL(x, FOTA_FINISH_STR_Y+(FOTA_FINISH_STR_H-h)/2, STR_ID_FW_UPGRADE_SUCCESSFUL);
				}
				else
			  #endif
				{
					x = w > FOTA_START_STR_W ? FOTA_START_STR_X : (LCD_WIDTH-w)/2;
					LCD_ShowUniStr(x, FOTA_FINISH_STR_Y+(FOTA_FINISH_STR_H-h)/2, STR_ID_FW_UPGRADE_SUCCESSFUL);
			  	}
			#endif
			
				SetLeftKeyUpHandler(fota_reboot_confirm);
				SetRightKeyUpHandler(fota_reboot_confirm);
			#ifdef CONFIG_TOUCH_SUPPORT
				register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_reboot_confirm);
			#endif
			}
		}
		break;
		
	case FOTA_STATUS_ERROR:
		{
			flag = false;

			LCD_Clear(BLACK);
			LCD_ShowImg_From_Flash(FOTA_FAIL_ICON_X, FOTA_FAIL_ICON_Y, IMG_OTA_FAILED_ICON_ADDR);
			
		#ifdef FONTMAKER_UNICODE_FONT
			LCD_MeasureUniStr(STR_ID_FW_UPGRADE_FAILED, &w, &h);
		  #ifdef LANGUAGE_AR_ENABLE	
			if(g_language_r2l)
			{
				x = w > FOTA_START_STR_W ? (FOTA_START_STR_X+FOTA_START_STR_W) : (LCD_WIDTH+w)/2;
				LCD_ShowUniStrRtoL(x, FOTA_FAIL_STR_Y+(FOTA_FAIL_STR_H-h)/2, STR_ID_FW_UPGRADE_FAILED);
			}
			else
		  #endif
			{
				x = w > FOTA_START_STR_W ? FOTA_START_STR_X : (LCD_WIDTH-w)/2;
				LCD_ShowUniStr(x, FOTA_FAIL_STR_Y+(FOTA_FAIL_STR_H-h)/2, STR_ID_FW_UPGRADE_FAILED);
		  	}
		#endif	

			SetLeftKeyUpHandler(fota_exit);
			SetRightKeyUpHandler(fota_exit);
		#ifdef CONFIG_TOUCH_SUPPORT
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_exit);
		#endif	
		}
		break;
		
	case FOTA_STATUS_MAX:
		flag = false;
		break;
	}
}

void FOTAScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FOTA].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FOTA].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FOTA].status = SCREEN_STATUS_CREATED;

