duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
	screen_id = SCREEN_ID_SOS;	
	scr_msg[SCREEN_ID_SOS].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_SOS].status = SCREEN_STATUS_CREATING;

	ClearAllKeyHandler();
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif
	
}


void MainMenuUpdateStatus(void)
{
	uint16_t i,x,y,w,h;
	uint32_t img_pg_dot[2] = {IMG_ID_PAGE2_1, IMG_ID_PAGE2_2};
	
	for(i=0;i<MAIN_MENU_MAX_PER_PG;i++)
	{
		LCD_ShowImage(MAIN_MENU_ICON_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_W+MAIN_MENU_ICON_OFFSET_W), MAIN_MENU_ICON_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_H+MAIN_MENU_ICON_OFFSET_H), main_menu.icon[i+main_menu.index]);

		LCD_SetFontSize(FONT_SIZE_28);
		LCD_SetFontColor(WHITE);

		LCD_Fill(MAIN_MENU_STR_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_W+MAIN_MENU_STR_OFFSET_W),
					MAIN_MENU_STR_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_H+MAIN_MENU_STR_OFFSET_H),
					MAIN_MENU_STR_W,
					MAIN_MENU_STR_H,
					BLACK);
		LCD_MeasureUniStr(main_menu.name[i+main_menu.index], &w, &h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_AdaptShowUniStrRtoLInRect(MAIN_MENU_STR_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_W+MAIN_MENU_STR_OFFSET_W)+w,
											MAIN_MENU_STR_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_H+MAIN_MENU_STR_OFFSET_H),
											MAIN_MENU_STR_W,
											MAIN_MENU_STR_H,
											main_menu.name[i+main_menu.index],
											SHOW_ALIGN_CENTER,
											SHOW_ALIGN_BOUNDARY);
		else
	#endif
			LCD_AdaptShowUniStrInRect(MAIN_MENU_STR_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_W+MAIN_MENU_STR_OFFSET_W),
										MAIN_MENU_STR_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_H+MAIN_MENU_STR_OFFSET_H),
										MAIN_MENU_STR_W,
										MAIN_MENU_STR_H,
										main_menu.name[i+main_menu.index],
										SHOW_ALIGN_CENTER,
										SHOW_ALIGN_BOUNDARY);

	#ifdef CONFIG_TOUCH_SUPPORT
		register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
									MAIN_MENU_ICON_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_W+MAIN_MENU_ICON_OFFSET_W), 
									MAIN_MENU_ICON_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_W+MAIN_MENU_ICON_OFFSET_W)+MAIN_MENU_ICON_W, 
									MAIN_MENU_ICON_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_H+MAIN_MENU_ICON_OFFSET_H), 
									MAIN_MENU_ICON_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_H+MAIN_MENU_ICON_OFFSET_H)+MAIN_MENU_ICON_H, 
									main_menu.sel_handler[i+main_menu.index]);
	#endif
	}

#ifdef LANGUAGE_AR_ENABLE
	if(g_language_r2l)
		LCD_ShowImage(LCD_WIDTH-MAIN_MENU_PG_DOT_X-MAIN_MENU_PG_DOT_W, MAIN_MENU_PG_DOT_Y, img_pg_dot[main_menu.index/MAIN_MENU_MAX_PER_PG]);
	else
#endif		
		LCD_ShowImage(MAIN_MENU_PG_DOT_X, MAIN_MENU_PG_DOT_Y, img_pg_dot[main_menu.index/MAIN_MENU_MAX_PER_PG]);

#ifdef CONFIG_TOUCH_SUPPORT
	register_touch_event_handle(TP_EVENT_MOVING_UP, 0, LCD_WIDTH, 0, LCD_HEIGHT, main_menu.pg_handler[0]);
	register_touch_event_handle(TP_EVENT_MOVING_DOWN, 0, LCD_WIDTH, 0, LCD_HEIGHT, main_menu.pg_handler[1]);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, main_menu.pg_handler[2]);
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, main_menu.pg_handler[3]);
#endif		
}

void MainMenuShowStatus(void)
{
	uint16_t i,x,y,w,h;
	uint32_t img_pg_dot[2] = {IMG_ID_PAGE2_1, IMG_ID_PAGE2_2};
	
	for(i=0;i<MAIN_MENU_MAX_PER_PG;i++)
	{
		LCD_ShowImage(MAIN_MENU_ICON_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_W+MAIN_MENU_ICON_OFFSET_W), MAIN_MENU_ICON_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_H+MAIN_MENU_ICON_OFFSET_H), main_menu.icon[i+main_menu.index]);

		LCD_SetFontSize(FONT_SIZE_28);
		LCD_SetFontColor(WHITE);

		LCD_MeasureUniStr(main_menu.name[i+main_menu.index], &w, &h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_AdaptShowUniStrRtoLInRect(MAIN_MENU_STR_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_W+MAIN_MENU_STR_OFFSET_W)+w,
											MAIN_MENU_STR_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_H+MAIN_MENU_STR_OFFSET_H),
											MAIN_MENU_STR_W,
											MAIN_MENU_STR_H,
											main_menu.name[i+main_menu.index],
											SHOW_ALIGN_CENTER,
											SHOW_ALIGN_BOUNDARY);
		else
	#endif
			LCD_AdaptShowUniStrInRect(MAIN_MENU_STR_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_W+MAIN_MENU_STR_OFFSET_W),
										MAIN_MENU_STR_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_STR_H+MAIN_MENU_STR_OFFSET_H),
										MAIN_MENU_STR_W,
										MAIN_MENU_STR_H,
										main_menu.name[i+main_menu.index],
										SHOW_ALIGN_CENTER,
										SHOW_ALIGN_BOUNDARY);

	#ifdef CONFIG_TOUCH_SUPPORT
		register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
									MAIN_MENU_ICON_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_W+MAIN_MENU_ICON_OFFSET_W), 
									MAIN_MENU_ICON_X+(i%MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_W+MAIN_MENU_ICON_OFFSET_W)+MAIN_MENU_ICON_W, 
									MAIN_MENU_ICON_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_H+MAIN_MENU_ICON_OFFSET_H), 
									MAIN_MENU_ICON_Y+(i/MAIN_MENU_MAX_PER_ROW)*(MAIN_MENU_ICON_H+MAIN_MENU_ICON_OFFSET_H)+MAIN_MENU_ICON_H, 
									main_menu.sel_handler[i+main_menu.index]);
	#endif
	}

#ifdef LANGUAGE_AR_ENABLE
	if(g_language_r2l)
		LCD_ShowImage(LCD_WIDTH-MAIN_MENU_PG_DOT_X-MAIN_MENU_PG_DOT_W, MAIN_MENU_PG_DOT_Y, img_pg_dot[main_menu.index/MAIN_MENU_MAX_PER_PG]);
	else
#endif		
		LCD_ShowImage(MAIN_MENU_PG_DOT_X, MAIN_MENU_PG_DOT_Y, img_pg_dot[main_menu.index/MAIN_MENU_MAX_PER_PG]);

#ifdef CONFIG_TOUCH_SUPPORT
	register_touch_event_handle(TP_EVENT_MOVING_UP, 0, LCD_WIDTH, 0, LCD_HEIGHT, main_menu.pg_handler[0]);
	register_touch_event_handle(TP_EVENT_MOVING_DOWN, 0, LCD_WIDTH, 0, LCD_HEIGHT, main_menu.pg_handler[1]);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, main_menu.pg_handler[2]);
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, main_menu.pg_handler[3]);
#endif		
}

void MainMenuScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_MAIN_MENU].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_MAIN_MENU].status = SCREEN_STATUS_CREATED;
		
		LCD_Clear(BLACK);
		IdleShowSignal();
		IdleShowNetMode();
		IdleShowBatSoc();
	#ifdef CONFIG_BLE_SUPPORT	
		IdleShowBleStatus();
	#endif
		MainMenuShowStatus();
		break;
		
